Revit 2026 API

# FieldValues(FieldValues) Constructor

---

Creates a copy of the given FieldValues instance.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FieldValues(
	FieldValues otherObject
)
```
```vb
Public Sub New (
	otherObject As FieldValues
)
```
```cpp
public:
FieldValues(
	FieldValues^ otherObject
)
```
```fsharp
new :
        otherObject : FieldValues -> FieldValues
```

#### Parameters

otherObject FieldValues

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FieldValues Class

FieldValues Overload

Autodesk.Revit.DB.Analysis Namespace